In [1]:
import pandas as pd

In [6]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df1.head(3) #top 3 rows

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [10]:
df1.iloc[0:3] #top 3 rows

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [11]:
df1.tail(3) #last 3 rows

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [17]:
df1.iloc[-3:] #last 3 rows

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [18]:
df1.shape #shape of dataframe

(7, 3)

In [22]:
print('No of Rows', df1.shape[0]) # Print above seperately
print('No of Rows', df1.shape[1])

No of Rows 7
No of Rows 3

In [24]:
df1.info() # info incl memory, total rows & columns.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
Name      7 non-null object
Marks     7 non-null int64
Gender    7 non-null object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [25]:
df1.isnull() # find null values

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [29]:
df1.isnull().sum(axis=0) # sum of null values

Name      0
Marks     0
Gender    0
dtype: int64

In [31]:
df1.describe(include='all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Mittal        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

In [32]:
df1['Gender'].unique() # Unique value from any column

array(['Male', 'Female'], dtype=object)

In [34]:
df1['Gender'].nunique() # No of unique Values

2

In [39]:
df1['Gender'].value_counts() # unique value distribution

Female    4
Male      3
Name: Gender, dtype: int64

In [45]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)] # Students marks between 90 to 100

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [48]:
df1[df1['Marks'].between(90,100) #above using between method

4

In [50]:
df1['Marks'].mean() #Average of marks column

92.14285714285714

In [54]:
def marks(x):
    return x//2

In [55]:
df1['Marks'].apply(marks) #apply function

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [56]:
df1['Half_marks']=df1['Marks'].apply(marks) # add a column

In [57]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [58]:
df1['Marks'].apply(lambda x:x/2) #Using Lambda function

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [61]:
df1['Name'].apply(len) #Length of each row

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [66]:
df1['Mapped_Gender']=df1['Gender'].map({'Male':1,'Female':0}) #Use map Function

In [67]:
df1

      Name  Marks  Gender  Half_marks  Mapped_Gender
0  Priyang     98    Male          49              1
1   Aadhya     89  Female          44              0
2   Krisha     99  Female          49              0
3   Vedant     87    Male          43              1
4   Parshv     90    Male          45              1
5   Mittal     83  Female          41              0
6  Archana     99  Female          49              0

In [70]:
df1.drop(['Mapped_Gender','Half_marks'], axis=1 , inplace=True) # Drop columns

In [72]:
df1.columns # columns Name

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [74]:
df1.sort_values(by=['Marks','Gender'] , ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [82]:
df1[df1['Gender']=='Female'][['Name','Marks']] # Only female with column Name & Marks

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [84]:
df1[df1['gender'].isin(['Female'])[['Name','Marks']]

SyntaxError: unexpected EOF while parsing (<ipython-input-84-031a9bbbdcb3>, line 1)